package io.github.Concurrentnost;

//9. Задача о медведе и пчелах
//Есть N пчел и медведь. Они пользуются одним горшком меда, вмещающим H порций меда. Сначала
//горшок пустой. Пока горшок не наполнится, медведь спит, потом съедает весь мед и засыпает. Каждая
//пчела многократно собирает по одной порции меда и кладет ее в горшок. Пчела, которая приносит
//последнюю порцию меда и заполняет горшок, будит медведя. Представьте медведя и пчел процессами,
//разработайте код, моделирующий их действия.


public class Main {
    static void main() {

    }
}
